bot1 = '1561131333:AAHwHBcH6i_Owgv21Y1Q99CtxcGKE3dERps'
admin_bot = '1434491082:AAE0C-mcl11hKhuuBdjOnYF1rtPEf17x9TE'
me = '1506064654:AAFFMyQMPh_CqlPe2k_5wmO1twkJHhXyzEM'
haltura_reg_team = '1597255037:AAGIHWQH8LNajTZA2ABIzxK8evxLsqt6ddQ'
admin = 502578674
admin2 = 810121389

sxem = [
    {'source': '',
    'file_name': '',
    'price': ''
    },
    {'id': '1', 'sxem_name': 'Заработок на продаже плюшевых медведей', 'source': '', 'file_name': '', 'price': '190₽'},
    {'id': '2', 'sxem_name': 'Заработок на продаже картинок', 'source': '', 'file_name': '', 'price': '49₽'},
    {'id': '3', 'sxem_name': 'Заработак на кошельке Payeer', 'source': '', 'file_name': '', 'price': '90₽'},
    {'id': '4', 'sxem_name': 'Заработок на смс', 'source': '', 'file_name': '', 'price': '39₽'},
    {'id': '5', 'sxem_name': 'Заработок на докумментах ВК', 'source': '', 'file_name': '', 'price': '39₽'},
    {'id': '6', 'sxem_name': 'Заработок на халяве со всего телеграм', 'source': '', 'file_name': '', 'price': '39₽'},
    {'id': '7', 'sxem_name': 'Заработок на продаже готовых шаблонов для сайтов', 'source': '', 'file_name': '', 'price': '90₽'},
    {'id': '8', 'sxem_name': 'Заработок на просмотре фотографий', 'source': '', 'file_name': '', 'price': '90₽'},
    {'id': '9', 'sxem_name': 'Заработок на монетизации статей на Яндекс.Дзен', 'source': '', 'file_name': '', 'price': '190₽'},
    {'id': '10', 'sxem_name': 'Получаем халявные 3500 и получаем деньги на пассиве', 'source': '', 'file_name': '', 'price': '490₽'},
    {'id': '11', 'sxem_name': 'Заработок на выполнении заданий в приложении БиМайАй', 'source': '', 'file_name': '', 'price': '290₽'},
    {'id': '12', 'sxem_name': 'Заработок на фейковых конкурсах instagram', 'source': '', 'file_name': '', 'price': '190₽'},
    {'id': '13', 'sxem_name': 'Заработок на чатах в телеграме', 'source': '', 'file_name': '', 'price': '590₽'},
    {'id': '14', 'sxem_name': 'Пассивный доход на играх с помощью YouTube и Twitch', 'source': '', 'file_name': '', 'price': '290₽'},
    {'id': '15', 'sxem_name': 'Монетизация на Яндекс.Эфире', 'source': '', 'file_name': '', 'price': '390₽'},
    {'id': '16', 'sxem_name': 'Пассивный заработок на уведомлениях', 'source': '', 'file_name': '', 'price': '290₽'},
    {'id': '17', 'sxem_name': 'Фарм БигМаков', 'source': '', 'file_name': '', 'price': '190₽'},
    {'id': '18', 'sxem_name': 'Стать частью команды (@dasolnce)', 'source': '', 'file_name': '', 'price': 'Бесплатно'},
    {'id': '19', 'sxem_name': 'Разьебываем АльфаБанк трафиком 1.0', 'source': '', 'file_name': '', 'price': '90₽'},
    {'id': '20', 'sxem_name': 'Разьебываем АльфаБанк трафиком 2.0', 'source': '', 'file_name': '', 'price': '490₽'},
    {'id': '21', 'sxem_name': 'Схема со сдачей крови', 'source': '', 'file_name': '', 'price': '490₽'},
    {'id': '22', 'sxem_name': 'Продажа верифицированных Qiwi аккаунтов', 'source': '', 'file_name': '', 'price': '390₽'},
    {'id': '23', 'sxem_name': 'Рефаунд Apple Store (@dasolnce)', 'source': '', 'file_name': '', 'price': '9900₽'},
    {'id': '24', 'sxem_name': 'Заработок на рукапче', 'source': '', 'file_name': '', 'price': '19₽'},
    {'id': '25', 'sxem_name': 'Заработок на лайках и подписках', 'source': '', 'file_name': '', 'price': '19₽'},
    {'id': '26', 'sxem_name': 'Заработок на выращивании микрозелени', 'source': '', 'file_name': '', 'price': '190₽'},
    {'id': '27', 'sxem_name': 'Чат Фриланс предложений для своих', 'source': '', 'file_name': '', 'price': '59₽'},
    #{'id': '28', 'sxem_name': 'Покупка Qiwi кошельков, фейков ВК, сим-карт', 'source': '', 'file_name': '', 'price': '(Qiwi: 500, VK: 90, SIM: 110)'} ### ЭТО КАТАЛОГ
]

tegs = {'18+ Заработок': [1, 3, 18, 19, 20, 21, 23, 27], '18- Заработок': [1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 22, 23, 24, 25, 26, 27], 'Активный заработок': [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 26, 27], 'Пассивный заработок': [3, 5, 8, 10, 12, 13, 14, 15, 16, 18, 23, 24, 25, 27], 'Онлайн заработок': [3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 22, 23, 24, 25, 27], 'Оффлайн заработок': [1, 2, 11, 17, 18, 21, 22, 23, 26, 27], 'Белый заработок': [1, 2, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 21, 23, 24, 25, 26, 27], 'Серый заработок': [3, 4, 5, 12, 13, 15, 17, 18, 20, 22, 23, 27]}